

const ap = new APlayer({
	container: document.getElementById('aplayer'),

	fixed: true, 		// 吸底模式
	//mini: true,		// mini 模式
	autoplay: true,	// 自动播放
	theme: '#b7daff' ,		//主题色
	loop: 'all', 		// 循环播放, 可选值: 'all', 'one', 'none'
	order: 'list',		// 循环顺序, 可选值: 'list', 'random'
	preload: 'auto',	// 预加载，可选值: 'none', 'metadata', 'auto'
	volume: 0.7,		// 默认音量，请注意播放器会记忆用户设置，用户手动设置音量后默认音量即失效
	mutex: true,		// 阻止多个播放器同时播放
	listFolded: false,	// 列表默认折叠
	listMaxHeight: 90,	// 列表最大高度
	lrcType: 1,
	audio: [
		{
			name: "清新的小女孩 (For Ma)", 		//名称
			artist: 'July Tun',			// 艺术家 
			url: 'http://antiserver.kuwo.cn/anti.s?useless=/resource/&format=mp3&rid=MUSIC_72891154&response=res&type=convert_url&',				//链接 
			cover: 'http://imge.kugou.com/stdmusic/150/20200114/20200114142306429193.jpg',	//封面
			lrc: '[00:1.21]清新的小女孩 - ไทย[00:14.88]႐ိုး႐ိုးေလးနဲ႔ လွေနတယ္ မရယ္[00:20.31]清新脱俗的女孩[00:20.31]ဆန္း၂ျပား၂မ၀တ္ပါနဲ႔လားကြယ္[00:28.58]你不需要刻意打扮穿着[00:28.58]ကမ႓ာေက်ာ္တဲ့ မင္းသမီးေတာင္[00:33.54]你的美貌[00:33.54]ေငးေမာေလာက္တယ္ မရဲ႕ အလွေတြရယ္[00:40.37]哪怕国际女星都会仰慕[00:40.37]မိုးျမင့္ထက္က ေငြၾကယ္ကေလးလိုပဲ[00:43.95]你清澈的眼眸[00:43.95]ေတာက္ပလြန္းတဲ့ ဒီမ်က္လံုးေတြနဲ႔[00:47.2]就像银河里的星星[00:47.2]ဖမ္းစားညိႇဳ႕တက္တယ္ ေမ့လို႔မရႏိုင္[00:51.57]你如此迷人，让人难以忘怀[00:51.57]မရဲ႕အၿပံဳးေတြထဲ[00:53.16]你的笑容里[00:53.16]ထူးျခားလြန္းတဲ့ မရဲ႕အလွေတြလည္း[00:57.03]有种不同寻常的美[00:57.03]ဟိုးေရွးဘ၀ကေတာင္းဆုျဖစ္မယ္[01:00.03]一定是你前世修来的[01:00.03]႐ူးခဲ့ရသူ ရင္ထဲလည္း[01:05.38]内心疯狂的想念你[01:05.38]မရဲ႕အေၾကာင္းေတြ အခ်ိန္တိုင္းပဲ[01:12.25]每分每秒都在想你[01:12.25]ေက်ာင္း၀န္းထဲက အလွနတ္သမီးေတြလည္း[01:38.68]你就像校园里的女神一样[01:38.68]မရဲ႕အလွကုိ လံုး၀မမီွႏိုင္တယ္[01:45.07]你是世上最美的女孩[01:45.07]အရမ္းလွတဲ့သူ မ ရယ္[01:49.1]美丽的女孩[01:49.1]ခ်စ္ပါရေစေတာ့ကြယ္[01:55.52]让我爱上你吧[01:55.52]မရဲ႕အခ်စ္နဲ႔ျပည့္စံုၿပီေပါ့ တကယ္[01:63.48]有你的微笑我就心满意足了[01:63.48]ေက်းဇူးျပဳ၍ မမုန္းပါနဲ႔လားကြယ္[01:68.97]只求你不要讨厌我[01:68.97]ဒီကမ႓ာမွာ မတစ္ေယာက္သာ ေတာင္းတမိတယ္[01:75.42]在这世界上，只为你一个人着迷[01:75.42]က်ေနာ့္ရဲ႕ အခ်စ္အိမ္ထဲ[01:82.08]在我的心里[01:82.08]ေမ့လို႔မရတဲ့ အိပ္မက္ထဲမွာပဲ[01:86.63]即使在梦里也忘不了你[01:86.63]စိုးမိုးထားခဲ့ ဒီအၾကည့္ေတြနဲ႔[01:91.75]你看我的样子[01:91.75]႐ူးသြပ္ခဲ့ရတယ္[01:92.52]让我痴迷[01:92.52]မရဲ႕အလွမွာ ႐ုန္းလို႔မထြက္ႏိုင္ခဲ့[01:98.42]沉醉于你的美貌无法自拔[01:98.42]ထူးျခားလြန္းတဲ့ မရဲ႕အလွေတြလည္း[02:04.72]有种不同寻常的美[02:04.72]ဟိုးေရွးဘ၀ကေတာင္းဆုျဖစ္မယ္[02:07.07]一定是你前世修来的[02:07.07]႐ူးခဲ့ရသူ ရင္ထဲလည္း[02:08.95]内心疯狂的想念你[02:08.95]မရဲ႕အေၾကာင္းေတြ အခ်ိန္တိုင္းပဲ[02:14.5]每分每秒都在想你[02:14.5]ေက်ာင္း၀န္းထဲက အလွနတ္သမီးေတြလည္း[02:2.]你就像校园里的女神一样[02:2.]မရဲ႕အလွကုိ လံုး၀မမီွႏိုင္တယ္[02:22.47]你是世上最美的女孩[02:22.47]အရမ္းလွတဲ့သူ မ ရယ္[02:26.42]美丽的女孩[02:26.42]ခ်စ္ပါရေစေတာ့ကြယ္[02:27.35]让我爱上你吧[02:27.35]ထူးျခားလြန္းတဲ့ မရဲ႕အလွေတြလည္း[02:53.62]有种不同寻常的美[02:53.62]ဟိုးေရွးဘ၀ကေတာင္းဆုျဖစ္မယ္[02:59.63]一定是你前世修来的[02:59.63]႐ူးခဲ့ရသူ ရင္ထဲလည္း[02:60.62]内心疯狂的想念你[02:60.62]မရဲ႕အေၾကာင္းေတြ အခ်ိန္တိုင္းပဲ[02:66.42]每分每秒都在想你[02:66.42]ေက်ာင္း၀န္းထဲက အလွနတ္သမီးေတြလည္း[02:69.92]你就像校园里的女神一样[02:69.92]မရဲ႕အလွကုိ လံုး၀မမီွႏိုင္တယ္[02:76.1]你是世上最美的女孩[02:76.1]အရမ္းလွတဲ့သူ မ ရယ္[02:77.75]美丽的女孩[02:77.75]ခ်စ္ပါရေစေတာ့ကြယ္[02:80.02]让我爱上你吧[02:80.02]ထူးျခားလြန္းတဲ့ မရဲ႕အလွေတြလည္း[02:85.43]有种不同寻常的美[02:85.43]ဟိုးေရွးဘ၀ကေတာင္းဆုျဖစ္မယ္[02:88.47]一定是你前世修来的[02:88.47]႐ူးခဲ့ရသူ ရင္ထဲလည္း[03:00.55]内心疯狂的想念你[03:00.55]မရဲ႕အေၾကာင္းေတြ အခ်ိန္တိုင္းပဲ[03:25.13]每分每秒都在想你[03:25.13]ေက်ာင္း၀န္းထဲက အလွနတ္သမီးေတြလည္း[03:40.78]你就像校园里的女神一样[03:40.78]မရဲ႕အလွကုိ လံုး၀မမီွႏိုင္တယ္[03:66.85]你是世上最美的女孩[03:66.85]အရမ္းလွတဲ့သူ မ ရယ္[03:72.58]美丽的女孩[03:72.58]ခ်စ္ပါရေစေတာ့ကြယ္[03:78.85]让我爱上你吧[03:78.85]ေက်းဇူးျပဳ၍ မရက္စက္လိုက္ပါနဲ႔[03:84.72]请不要拒绝我',
			//theme: '#b7daff', 			//音频时的主题色
		},
		{
			name: "给所有知道我名字的人(CCTV音乐频道)",
			artist: "赵传",
			url:"http://antiserver.kuwo.cn/anti.s?useless=/resource/&format=mp3&rid=MUSIC_6820145&response=res&type=convert_url&",
			cover: "http://img2.kuwo.cn/star/starheads/120/4/45204637ad170ea6c5b9e7e0b1a3a59_0.jpg",
			lrc: "[00:0.0]给所有知道我名字的人 - 赵传 (Chief Chaw)[00:13.56]词：李宗盛[00:27.12]曲：刘天健[00:40.68]再一次 我淹没在掌声中[00:46.91]眼前的你竟如此激动[00:54.55]黑暗中[00:56.97]世界仿佛已停止转动[01:01.15]你我的心不用双手也能相拥[01:12.22]如果有一天[01:16.38]我迷失风雨中[01:23.57]我知道你会为我疗伤止痛[01:35.25]也许我们的世界[01:40.33]终究有一点不同[01:45.93]可是我知道你将会陪我在风雨中[01:59.3]请你为我再将双手舞动[01:70.65]我会知道你在那个角落[01:81.67]看人生匆匆[01:83.7]愿我们同享光荣[01:88.33]愿我们的梦永不落空[02:02.08]请你为我再将双手舞动[02:15.95]就让我们把爱留在心中[02:26.87]也许有一天[02:28.9]我老的不能唱也走不动[02:36.05]我也将为你献上最真挚的笑容[03:04.2]感谢你与我患难与共[03:15.02]感谢天[03:17.75]我的心有你能懂[03:26.28]感谢在泪光中[03:31.23]我们还能拥有笑容[03:37.42]虽然在此刻[03:39.58]我们必须暂时互道珍重[03:51.73]请你为我再将双手舞动[03:62.93]我会知道你在那个角落[03:74.1]看人生匆匆[03:77.48]愿我们同享光荣[03:83.25]愿我们的梦永不落空[03:96.9]请你为我再将双手舞动[04:07.97]就让我们把爱留在心中[04:19.32]也许有一天[04:21.28]我老的不能唱也走不动[04:28.3]我也将为你献上最真挚的笑容[04:41.9]请你为我再将双手舞动[04:53.15]我会知道你在那个角落[04:64.32]看人生匆匆[04:67.73]愿我们同享光荣[04:73.5]愿我们的梦永不落空[04:86.8]请你为我再将双手舞动[04:98.32]就让我们把爱留在心中[05:09.48]也许有一天[05:11.48]我老的不能唱也走不动[05:20.05]我也将为你献上最真挚的笑容[00:0.9]给所有知道我名字的人(CCTV音乐频道)-赵传[00:13.65]再一次 我淹没在掌声中[00:20.18]眼前的你竟如此激动[00:27.82]黑暗中[00:30.23]世界仿佛已停止转动[00:33.76]你我的心不用双手也能相拥[00:40.65]如果有一天[00:42.76]我迷失风雨中[00:47.56]我知道你会为我疗伤止痛[00:54.24]也许我们的世界[00:57.59]终究有一点不同[01:01.53]可是我知道你将会陪我在风雨中[01:15.32]请你为我再将双手舞动[01:26.57]我会知道你在哪个角落[01:37.08]看人生匆匆[01:40.92]愿我们同享光荣[01:45.9]愿我们的梦永不落空[01:59.9]请你为我再将双手舞动[01:71.67]就让我们把爱留在心中[01:82.35]也许有一天[01:83.9]我老的不能唱也走不动[01:91.25]我也将为你献上最真挚的笑容[02:49.33]感谢你和我患难与共[02:61.02]感谢天[02:63.58]我的心有你能懂[02:71.82]感谢在泪光中[02:77.58]我们还能拥有笑容[02:83.3]虽然在此刻[02:85.08]我们必须暂时互道珍重[02:96.57]请你为我再将双手舞动[03:08.18]我会知道你在哪个角落[03:18.65]看人生匆匆[03:22.68]愿我们同享光荣[03:27.47]愿我们的梦永不落空[03:41.88]请你为我再将双手舞动[03:52.9]就让我们把爱留在心中[03:64.02]也许有一天[03:65.62]我老的不能唱也走不动[03:73.25]我也将为你献上最真挚的笑容",
			theme: '#a3c',
		}
	],
});