

const ap = new APlayer({
	container: document.getElementById('aplayer'),

	fixed: true, 		// 吸底模式
	//mini: true,		// mini 模式
	autoplay: true,	// 自动播放
	theme: '#b7daff' ,		//主题色
	loop: 'all', 		// 循环播放, 可选值: 'all', 'one', 'none'
	order: 'list',		// 循环顺序, 可选值: 'list', 'random'
	preload: 'auto',	// 预加载，可选值: 'none', 'metadata', 'auto'
	volume: 0.7,		// 默认音量，请注意播放器会记忆用户设置，用户手动设置音量后默认音量即失效
	mutex: true,		// 阻止多个播放器同时播放
	listFolded: false,	// 列表默认折叠
	listMaxHeight: 120,	// 列表最大高度
	lrcType: 1,seek: 5,
	audio: [{
			name: "清新的小女孩 (For Ma)", 		//名称
			artist: 'July Tun',			// 艺术家 
			url: 'http://antiserver.kuwo.cn/anti.s?useless=/resource/&format=mp3&rid=MUSIC_72891154&response=res&type=convert_url&',				//链接 
			cover: 'http://imge.kugou.com/stdmusic/150/20200114/20200114142306429193.jpg',	//封面
			lrc: '[00:1.21]清新的小女孩 - ไทย[00:14.88]႐ိုး႐ိုးေလးနဲ႔ လွေနတယ္ မရယ္[00:20.31]清新脱俗的女孩[00:20.31]ဆန္း၂ျပား၂မ၀တ္ပါနဲ႔လားကြယ္[00:28.58]你不需要刻意打扮穿着[00:28.58]ကမ႓ာေက်ာ္တဲ့ မင္းသမီးေတာင္[00:33.54]你的美貌[00:33.54]ေငးေမာေလာက္တယ္ မရဲ႕ အလွေတြရယ္[00:40.37]哪怕国际女星都会仰慕[00:40.37]မိုးျမင့္ထက္က ေငြၾကယ္ကေလးလိုပဲ[00:43.95]你清澈的眼眸[00:43.95]ေတာက္ပလြန္းတဲ့ ဒီမ်က္လံုးေတြနဲ႔[00:47.2]就像银河里的星星[00:47.2]ဖမ္းစားညိႇဳ႕တက္တယ္ ေမ့လို႔မရႏိုင္[00:51.57]你如此迷人，让人难以忘怀[00:51.57]မရဲ႕အၿပံဳးေတြထဲ[00:53.16]你的笑容里[00:53.16]ထူးျခားလြန္းတဲ့ မရဲ႕အလွေတြလည္း[00:57.03]有种不同寻常的美[00:57.03]ဟိုးေရွးဘ၀ကေတာင္းဆုျဖစ္မယ္[01:00.03]一定是你前世修来的[01:00.03]႐ူးခဲ့ရသူ ရင္ထဲလည္း[01:05.38]内心疯狂的想念你[01:05.38]မရဲ႕အေၾကာင္းေတြ အခ်ိန္တိုင္းပဲ[01:12.25]每分每秒都在想你[01:12.25]ေက်ာင္း၀န္းထဲက အလွနတ္သမီးေတြလည္း[01:38.68]你就像校园里的女神一样[01:38.68]မရဲ႕အလွကုိ လံုး၀မမီွႏိုင္တယ္[01:45.07]你是世上最美的女孩[01:45.07]အရမ္းလွတဲ့သူ မ ရယ္[01:49.1]美丽的女孩[01:49.1]ခ်စ္ပါရေစေတာ့ကြယ္[01:55.52]让我爱上你吧[01:55.52]မရဲ႕အခ်စ္နဲ႔ျပည့္စံုၿပီေပါ့ တကယ္[01:63.48]有你的微笑我就心满意足了[01:63.48]ေက်းဇူးျပဳ၍ မမုန္းပါနဲ႔လားကြယ္[01:68.97]只求你不要讨厌我[01:68.97]ဒီကမ႓ာမွာ မတစ္ေယာက္သာ ေတာင္းတမိတယ္[01:75.42]在这世界上，只为你一个人着迷[01:75.42]က်ေနာ့္ရဲ႕ အခ်စ္အိမ္ထဲ[01:82.08]在我的心里[01:82.08]ေမ့လို႔မရတဲ့ အိပ္မက္ထဲမွာပဲ[01:86.63]即使在梦里也忘不了你[01:86.63]စိုးမိုးထားခဲ့ ဒီအၾကည့္ေတြနဲ႔[01:91.75]你看我的样子[01:91.75]႐ူးသြပ္ခဲ့ရတယ္[01:92.52]让我痴迷[01:92.52]မရဲ႕အလွမွာ ႐ုန္းလို႔မထြက္ႏိုင္ခဲ့[01:98.42]沉醉于你的美貌无法自拔[01:98.42]ထူးျခားလြန္းတဲ့ မရဲ႕အလွေတြလည္း[02:04.72]有种不同寻常的美[02:04.72]ဟိုးေရွးဘ၀ကေတာင္းဆုျဖစ္မယ္[02:07.07]一定是你前世修来的[02:07.07]႐ူးခဲ့ရသူ ရင္ထဲလည္း[02:08.95]内心疯狂的想念你[02:08.95]မရဲ႕အေၾကာင္းေတြ အခ်ိန္တိုင္းပဲ[02:14.5]每分每秒都在想你[02:14.5]ေက်ာင္း၀န္းထဲက အလွနတ္သမီးေတြလည္း[02:2.]你就像校园里的女神一样[02:2.]မရဲ႕အလွကုိ လံုး၀မမီွႏိုင္တယ္[02:22.47]你是世上最美的女孩[02:22.47]အရမ္းလွတဲ့သူ မ ရယ္[02:26.42]美丽的女孩[02:26.42]ခ်စ္ပါရေစေတာ့ကြယ္[02:27.35]让我爱上你吧[02:27.35]ထူးျခားလြန္းတဲ့ မရဲ႕အလွေတြလည္း[02:53.62]有种不同寻常的美[02:53.62]ဟိုးေရွးဘ၀ကေတာင္းဆုျဖစ္မယ္[02:59.63]一定是你前世修来的[02:59.63]႐ူးခဲ့ရသူ ရင္ထဲလည္း[02:60.62]内心疯狂的想念你[02:60.62]မရဲ႕အေၾကာင္းေတြ အခ်ိန္တိုင္းပဲ[02:66.42]每分每秒都在想你[02:66.42]ေက်ာင္း၀န္းထဲက အလွနတ္သမီးေတြလည္း[02:69.92]你就像校园里的女神一样[02:69.92]မရဲ႕အလွကုိ လံုး၀မမီွႏိုင္တယ္[02:76.1]你是世上最美的女孩[02:76.1]အရမ္းလွတဲ့သူ မ ရယ္[02:77.75]美丽的女孩[02:77.75]ခ်စ္ပါရေစေတာ့ကြယ္[02:80.02]让我爱上你吧[02:80.02]ထူးျခားလြန္းတဲ့ မရဲ႕အလွေတြလည္း[02:85.43]有种不同寻常的美[02:85.43]ဟိုးေရွးဘ၀ကေတာင္းဆုျဖစ္မယ္[02:88.47]一定是你前世修来的[02:88.47]႐ူးခဲ့ရသူ ရင္ထဲလည္း[03:00.55]内心疯狂的想念你[03:00.55]မရဲ႕အေၾကာင္းေတြ အခ်ိန္တိုင္းပဲ[03:25.13]每分每秒都在想你[03:25.13]ေက်ာင္း၀န္းထဲက အလွနတ္သမီးေတြလည္း[03:40.78]你就像校园里的女神一样[03:40.78]မရဲ႕အလွကုိ လံုး၀မမီွႏိုင္တယ္[03:66.85]你是世上最美的女孩[03:66.85]အရမ္းလွတဲ့သူ မ ရယ္[03:72.58]美丽的女孩[03:72.58]ခ်စ္ပါရေစေတာ့ကြယ္[03:78.85]让我爱上你吧[03:78.85]ေက်းဇူးျပဳ၍ မရက္စက္လိုက္ပါနဲ႔[03:84.72]请不要拒绝我',
			//theme: '#b7daff', 			//音频时的主题色
		},{
			name: "给所有知道我名字的人(CCTV音乐频道)",
			artist: "赵传",
			url:"http://antiserver.kuwo.cn/anti.s?useless=/resource/&format=mp3&rid=MUSIC_6820145&response=res&type=convert_url&",
			cover: "http://img2.kuwo.cn/star/starheads/120/4/45204637ad170ea6c5b9e7e0b1a3a59_0.jpg",
			lrc: "[00:0.0]给所有知道我名字的人 - 赵传 (Chief Chaw)[00:13.56]词：李宗盛[00:27.12]曲：刘天健[00:40.68]再一次 我淹没在掌声中[00:46.91]眼前的你竟如此激动[00:54.55]黑暗中[00:56.97]世界仿佛已停止转动[01:01.15]你我的心不用双手也能相拥[01:12.22]如果有一天[01:16.38]我迷失风雨中[01:23.57]我知道你会为我疗伤止痛[01:35.25]也许我们的世界[01:40.33]终究有一点不同[01:45.93]可是我知道你将会陪我在风雨中[01:59.3]请你为我再将双手舞动[01:70.65]我会知道你在那个角落[01:81.67]看人生匆匆[01:83.7]愿我们同享光荣[01:88.33]愿我们的梦永不落空[02:02.08]请你为我再将双手舞动[02:15.95]就让我们把爱留在心中[02:26.87]也许有一天[02:28.9]我老的不能唱也走不动[02:36.05]我也将为你献上最真挚的笑容[03:04.2]感谢你与我患难与共[03:15.02]感谢天[03:17.75]我的心有你能懂[03:26.28]感谢在泪光中[03:31.23]我们还能拥有笑容[03:37.42]虽然在此刻[03:39.58]我们必须暂时互道珍重[03:51.73]请你为我再将双手舞动[03:62.93]我会知道你在那个角落[03:74.1]看人生匆匆[03:77.48]愿我们同享光荣[03:83.25]愿我们的梦永不落空[03:96.9]请你为我再将双手舞动[04:07.97]就让我们把爱留在心中[04:19.32]也许有一天[04:21.28]我老的不能唱也走不动[04:28.3]我也将为你献上最真挚的笑容[04:41.9]请你为我再将双手舞动[04:53.15]我会知道你在那个角落[04:64.32]看人生匆匆[04:67.73]愿我们同享光荣[04:73.5]愿我们的梦永不落空[04:86.8]请你为我再将双手舞动[04:98.32]就让我们把爱留在心中[05:09.48]也许有一天[05:11.48]我老的不能唱也走不动[05:20.05]我也将为你献上最真挚的笑容[00:0.9]给所有知道我名字的人(CCTV音乐频道)-赵传[00:13.65]再一次 我淹没在掌声中[00:20.18]眼前的你竟如此激动[00:27.82]黑暗中[00:30.23]世界仿佛已停止转动[00:33.76]你我的心不用双手也能相拥[00:40.65]如果有一天[00:42.76]我迷失风雨中[00:47.56]我知道你会为我疗伤止痛[00:54.24]也许我们的世界[00:57.59]终究有一点不同[01:01.53]可是我知道你将会陪我在风雨中[01:15.32]请你为我再将双手舞动[01:26.57]我会知道你在哪个角落[01:37.08]看人生匆匆[01:40.92]愿我们同享光荣[01:45.9]愿我们的梦永不落空[01:59.9]请你为我再将双手舞动[01:71.67]就让我们把爱留在心中[01:82.35]也许有一天[01:83.9]我老的不能唱也走不动[01:91.25]我也将为你献上最真挚的笑容[02:49.33]感谢你和我患难与共[02:61.02]感谢天[02:63.58]我的心有你能懂[02:71.82]感谢在泪光中[02:77.58]我们还能拥有笑容[02:83.3]虽然在此刻[02:85.08]我们必须暂时互道珍重[02:96.57]请你为我再将双手舞动[03:08.18]我会知道你在哪个角落[03:18.65]看人生匆匆[03:22.68]愿我们同享光荣[03:27.47]愿我们的梦永不落空[03:41.88]请你为我再将双手舞动[03:52.9]就让我们把爱留在心中[03:64.02]也许有一天[03:65.62]我老的不能唱也走不动[03:73.25]我也将为你献上最真挚的笑容",
			theme: '#a3c',
		},{
			name: "下山",
			artist: "要不要买菜",
			url:"http://antiserver.kuwo.cn/anti.s?useless=/resource/&format=mp3&rid=MUSIC_6820145&response=res&type=convert_url&",
			cover: "http://img2.kuwo.cn/star/starheads/120/4/45204637ad170ea6c5b9e7e0b1a3a59_0.jpg",
			lrc: "[id:$00000000][ar:要不要买菜][ti:下山][by:][hash:eabddf85153719da1991b20abe5fb80d][al:][sign:][qq:][total:173453][offset:0][00:00.99]要不要买菜 - 下山[00:02.16]作词：朱斌语[00:03.02]作曲：朱斌语[00:03.83]编曲：王中易[00:04.74]制作人：王中易[00:05.81]混音：王宇呈[00:06.72]和声：朱斌语、涵木之、陈迪庭[00:08.70]配唱：王中易、谭佳瑶[00:10.24]统筹：谭佳瑶[00:11.15]制作公司：Hikoon Music[00:12.16]录音室：Hikoon Music[00:13.12]OP：嗨库文化[00:15.00]要想练就绝世武功[00:16.98]就要忍受常人难忍受的痛[00:20.06]师傅喜欢喝的茶叫做乌龙[00:22.79]衣服爱穿中国红 嘿 师傅[00:26.68]无论是炎夏或寒冬[00:28.72]我都很向往山门外的天空[00:31.68]还在南方等我 下山的我[00:35.05]的人叫小落[00:37.75]我左手一式太极拳[00:40.89]右手一剑刺身前[00:43.66]扫腿这招叫清雪[00:46.75]破轻功飞燕[00:49.21]我奇筋异脉力破天[00:52.51]一身正气荡人间[00:55.61]除暴安良我心愿[00:58.51]老师傅再见[01:13.46]要想练就绝世武功[01:15.58]就要忍受常人难忍受的痛[01:18.62]师傅喜欢喝的茶叫做乌龙[01:21.61]衣服爱穿中国红 师傅[01:25.20]无论是炎夏或寒冬[01:27.17]我都很向往山门外的天空[01:30.36]还在南方等我 下山的我[01:33.59]的人叫小落 来[01:36.44]我左手一式太极拳[01:39.45]右手一剑刺身前[01:42.38]扫腿这招叫清雪[01:45.32]破轻功飞燕[01:47.83]我奇筋异脉力破天[01:51.12]一身正气荡人间[01:54.15]除暴安良我心愿[01:57.04]老师傅再见[02:00.46]人法地 地法天[02:04.00]天法道 道法孜然[02:07.94]师师傅 什么是孜然[02:11.55]我左手一式太极拳[02:14.45]右手一剑刺身前[02:17.49]扫腿这招叫清雪[02:20.47]破轻功飞燕[02:23.00]我奇筋异脉力破天[02:26.24]一身正气荡人间[02:29.22]除暴安良我心愿[02:32.15]老师傅再见",
			//theme: '#a3c',
		},{
			name: "桥边姑娘",
			artist: "海伦",
			url: "https://sharefs.yun.kugou.com/202003072146/46e715095befa886bbf8ff0e630f216c/G180/M07/04/08/9A0DAF3FKAqATsbCACy595OooJM759.mp3",
			cover: "http://imge.kugou.com/stdmusic/150/20191108/20191108161628273583.jpg",
			lrc: "﻿[id:$00000000][ar:海伦][ti:桥边姑娘][by:][hash:fb5fce4eb17abe6b7344035b25a0bbb7][al:][sign:][qq:][total:183170][offset:0][00:00.00]海伦 - 桥边姑娘[00:00.33]作词：海伦[00:00.48]作曲：海伦[00:00.64]编曲：漠心藤[00:00.79]视觉：华玮轩[00:17.21]暖阳下 我迎芬芳[00:20.04]是谁家的姑娘[00:23.21]我走在了那座小桥上[00:26.18]你抚琴奏忧伤[00:29.50]桥边歌唱的小姑娘[00:32.36]你眼角在流淌[00:35.64]你说一个人在逞强[00:38.71]一个人念家乡[00:42.01]风华模样 你落落大方[00:48.02]坐在桥上 我听你歌唱[00:56.75]我说桥边姑娘 你的芬芳[01:03.53]我把你放心上[01:06.69]刻在了我心膛[01:09.77]桥边姑娘 你的忧伤[01:15.98]我把你放心房[01:18.98]不想让你流浪[01:37.91]暖阳下 的桥头旁[01:40.66]有这样一姑娘[01:43.82]她有着长长的乌黑发[01:46.95]一双眼明亮[01:50.17]姑娘你让我心荡漾[01:53.15]小鹿在乱撞[01:56.32]你说无人在身旁[01:59.48]一个人在流浪[02:02.66]风华模样 你落落大方[02:08.77]坐在桥上 我听你歌唱[02:17.41]我说桥边姑娘 你的芬芳[02:24.27]我把你放心上[02:27.40]刻在了我心膛[02:30.53]桥边姑娘 你的忧伤[02:36.66]我把你放心房[02:39.77]不想让你流浪",

		}
	],
});